app/controllers/api/v1/airlines_controller.rb

SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "united-airlines"], ["LIMIT", 1]]
---
      def show
        airline = Airline.find_by(slug: params[:slug])

INSERT INTO "airlines" ("name", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "fake-airline"], ["slug", "fake-airline"], ["created_at", "2020-12-18 19:51:43.546420"], ["updated_at", "2020-12-18 19:51:43.546420"]]
---
      def create
        airline = Airline.new(airline_params)

        if airline.save

SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "fake-airline"], ["LIMIT", 1]]
DELETE FROM "airlines" WHERE "airlines"."id" = $1  [["id", 7]]
---
      def destroy
        airline = Airline.find_by(slug: params[:slug])

        if airline.destroy